org/gbasis/gbasis.org
-  変数が多くて，

-  次数が高い，

-  方程式の根を求める(逐次)アルゴリズム

コンピュータがたくさんあった場合，

-  逐次アルゴリズムから，

-  独立して計算できる部分問題を取り出し，

-  それぞれの計算機で同時に計算する．

-  部分問題をどのように渡し，結果をどうもらうか

   -  並列化した事による*通信のオーバーヘッド*

   -  通信量と計算量の比 (*粒度*)

-  コンピュータ数に対し，どれくらい速くなるのか

   -  問題自体の*並列度*

   -  台数にたいする速度向上は？ (*スケーラビリティ*)

* 方程式を解くとは？

-  一次方程式, $a x = b $

   #+BEGIN_QUOTE
     $$x = a^{-1} b$$
   #+END_QUOTE

-  連立一次方程式 (系)
   $$(a_{11} x_1 + a_{12} x_2 + \ldots = c_1,$$$$\cdots,$$
   $$a_{n1} x_1 + a_{n2} x_2 + \ldots = c_n)$$

   #+BEGIN_QUOTE

     -  線形代数, ガウスの消去法

     -  一次方程式, $a x = b$ に帰着させる

   #+END_QUOTE

-  一変数方程式, $a_n x^n + \cdots + a_0 = b$

   #+BEGIN_QUOTE

     -  根の公式, $x^n = c$ に帰着させる.

     -  帰着できない時, 数値計算 (ニュートン法) で近似的に求める.

   #+END_QUOTE

-  多変数(代数)方程式(系)
   $(f_1(x, \ldots, z) =0, \cdots, f_n(x, \ldots, z) =0)$

   #+BEGIN_QUOTE

     -  変数消去, 因数分解

     -  必ず解ける方法を知っていますか？

   #+END_QUOTE

** 基底とは

**** 問題

#+BEGIN_QUOTE
  天秤秤と, $a$ グラムの重りと $b$ グラムの重りが無数にあるとします.
  どんな重さが測れるでしょう？

  あるいは, $c$ グラムを測る事ができますか？
#+END_QUOTE

-  この問題は，不定方程式 $ax+by=c$ を満たす，整数 $x$, $y$ を求
   める問題となる．

-  この解は，$a$ と $b$ の最大公約数を求める問題に帰着さ れます．

-  $a$ と $b$ の組合わせで作れる最小の数は，最大公約数であ
   り，それの倍数しか$a$ と $b$ の組合わせでは作れません．

-  最大公約数は$a$ と $b$ の組合わせでできる数の集合の*基
   底*となります．

-  上の問題は，$a$ と $b$ の最大公約数を$g$ とすると，
   $c$ は $g$ の倍数でなければ解が存在しないこと，$a x + b y = g$
   の $x$ と $y$ は，Euclid の互除法によって求められます．

**** 問題

#+BEGIN_QUOTE
  二つの方程式 $f_1(x)=0, f_2(x)=0$ の共通根は？
#+END_QUOTE

それぞれの方程式の根を求めて, 共通な根を求めてもいいですが,

-  上の議論から，二つの式 $f_1(x), f_2(x)$ の組み合わせで できる,
   最も簡単な(次数の低い)式 (基底) を求め, その根を求める.

-  基底は， $f_1(x)$ と $f_2(x)$ の最大公約多項式($g(x)$)となり,
   $$A(x) f_1(x) + B(x) f_2(x) = g(x),$$ $$\deg(A(x)) < \deg(f_2(x)),$$
   $$\deg(B(x)) < \deg(f_1(x))$$

** 多変数方程式 をどう解くか?

$$(f_1(x, \ldots, z) =0, \cdots, f_n(x, \ldots, z) =0)$$

に対し，$f_1, \ldots, f_n$ を組合わせでできる任意の多項式

$$A_1(x, \ldots, z) f_1(x, \ldots, z) + \cdots + A_n(x, \ldots, z)
f_n(x, \ldots, z)$$

の集合を考えます．

この集合を $(f_1, ... , f_n)$ と表し，$f_1$ から $f_n$ が作る
*イデアル* ${\cal I}$ と呼ぶ．

${\cal I}$ を作ることのできる多項式の組をイデアルの基底と呼びます．

方程式を解くのに都合の良い基底を求めることは，同じ根を持つ，より簡単な
方程式系への変換となる．

この基底が例えば，

$$(g_1(x, z) =0, g_2(y,z) = 0, \cdots, g_m(z) =0)$$

という形で求まれば，多変数方程式の問題は， 一変数方程式の
問題に帰着される．

「このような変形はできるのか」，「変形する方針は」，「必ず求まるのか」
などが問題となる．

* パズルと基底

**** グラス置き換えパズル

ウィスキーのグラス $W$, ビールのグラス $B$, お酒のグラス $S$ が
一列に並んでいる.

グラスは次の置き換え規則で, 置き換えて良いとする.

$$置き換え規則 G \left\{ \begin{array}{rll}
B &  \leftarrow\rightarrow  &  W B\\
BS& \leftarrow\rightarrow   & W  \\
      \end{array}
\right.$$

**** 問題

1. $BSBS$ は $WWWB$ に置き換えできるか？

2. $BSBBS$ は $BWW$ に置き換えできるか？

**** 問題の難しい点

-  できる場合はその置き換えを示せば良いが,

-  できない事を示す事.

**** パズル解法への道

-  簡単な方へ置き換える (簡約化)ことにする.
   $$簡約規則 R \left\{ \begin{array}{rll}
   WB & \rightarrow  &  B\\
   BS & \rightarrow   & W  \\
         \end{array}
   \right.$$

-  これ以上簡約できないもの (正規形)

-  置き換え規則 $G$ で置き換え可能な列の要素は 簡約規則 $R$
   で同じ正規系を持つか？

   この性質が成り立てば, 簡約系で正規形が同じであれば,
   置き換え系で,置き換え可能となる.

-  置き換え可能なのに, 同じ正規形を持たない場合は,
   そのような簡約規則を追加すればよい.

   例えば, $WBS$ は二つの

   $$\left\{ \begin{array}{rllll}
   WBS & \rightarrow  &  WW\\
   WBS & \rightarrow   & BS & \rightarrow  & W\\
         \end{array}
   \right.$$

   置き換え系では, $WW$ と $W$ は, $WBS$ を通して置き換え可能である
   から, 簡約系で

   $$WW  \rightarrow   W$$

   を新しい簡約規則として採用すればいい事になる.

   この追加される簡約規則を同やって見付けるかが問題となる.

-  簡約規則の左項中で, 重なりが生ずるような二つの規則を探す.
   (この二つの簡約規則を*危険対*と呼ぶ).

   今の場合, $BS$ と $WB$ は 重なりを持つ項, $WBS$ を別の正規形に簡
   約する可能性を持つ.

-  この操作を次々に繰り返し, 危険対が全て同じ簡約形を持つよう
   になった時, 置き換え可能である物は, 全て同じ正規形を持つ事になる.

簡約系の*完備化*という.完備な系とは,

-  正規系は有限ステップで求まる. (*停止性*)

-  ある項の正規系は, 簡約順序によらず同じになる.(*合流性*)

