org/gbasis/gbasis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-01 木 16:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Masayuki Suzuki" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf55f116">1. 方程式を解くとは？</a>
<ul>
<li><a href="#org2359d76">1.1. 基底とは</a></li>
<li><a href="#org3d6e199">1.2. 多変数方程式 をどう解くか?</a></li>
</ul>
</li>
<li><a href="#orgc6e64f1">2. パズルと基底</a></li>
<li><a href="#org42e41ee">3. グレブナー基底</a>
<ul>
<li><a href="#org57a65fd">3.1. 項の間の順序</a></li>
<li><a href="#orgc01221e">3.2. 簡約</a></li>
<li><a href="#org73cd44f">3.3. S多項式</a></li>
<li><a href="#org5701255">3.4. グレブナー基底の定義</a></li>
</ul>
</li>
<li><a href="#org4d59f10">4. グレブナー基底から方程式の根を求める方法</a></li>
<li><a href="#org1232e1f">5. Buchberger算法と並列化</a>
<ul>
<li><a href="#org78a3ec3">5.1. Buchberger算法の並列性</a></li>
</ul>
</li>
<li><a href="#orgaa3d3ca">6. 並列算法の組合わせによる並列度の向上</a></li>
<li><a href="#orgd711521">7. $\mathbf{d}$-Gröbner 基底によるペア並列度の向上</a>
<ul>
<li><a href="#orgc1a35d7">7.1. $\mathbf{d}$-グレブナー基底</a></li>
<li><a href="#org8fd84fe">7.2. $\mathbf{d}$-グレブナー基底の並列性</a></li>
</ul>
</li>
<li><a href="#org58ec836">8. 実装と性能(予測)</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>変数が多くて，</li>

<li>次数が高い，</li>

<li>方程式の根を求める(逐次)アルゴリズム</li>
</ul>

<p>
コンピュータがたくさんあった場合，
</p>

<ul class="org-ul">
<li>逐次アルゴリズムから，</li>

<li>独立して計算できる部分問題を取り出し，</li>

<li>それぞれの計算機で同時に計算する．</li>

<li>部分問題をどのように渡し，結果をどうもらうか

<ul class="org-ul">
<li>並列化した事による*通信のオーバーヘッド*</li>

<li>通信量と計算量の比 (<b>粒度</b>)</li>
</ul></li>

<li>コンピュータ数に対し，どれくらい速くなるのか

<ul class="org-ul">
<li>問題自体の*並列度*</li>

<li>台数にたいする速度向上は？ (<b>スケーラビリティ</b>)</li>
</ul></li>
</ul>

<div id="outline-container-orgf55f116" class="outline-2">
<h2 id="orgf55f116"><span class="section-number-2">1</span> 方程式を解くとは？</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
一次方程式, $a x = b $
</p>

<blockquote>
<p>
\[x = a^{-1} b\]
</p>
</blockquote></li>

<li><p>
連立一次方程式 (系)
\[(a_{11} x_1 + a_{12} x_2 + \ldots = c_1,\]\[\cdots,\]
\[a_{n1} x_1 + a_{n2} x_2 + \ldots = c_n)\]
</p>

<blockquote>
<p>

</p>

<ul class="org-ul">
<li>線形代数, ガウスの消去法</li>

<li>一次方程式, $a x = b $ に帰着させる</li>
</ul>
</blockquote></li>

<li><p>
一変数方程式, \(a_n x^n + \cdots + a_0 = b\)
</p>

<blockquote>
<p>

</p>

<ul class="org-ul">
<li>根の公式, $x<sup>n</sup> = c $ に帰着させる.</li>

<li>帰着できない時, 数値計算 (ニュートン法) で近似的に求める.</li>
</ul>
</blockquote></li>

<li><p>
多変数(代数)方程式(系)
\((f_1(x, \ldots, z) =0, \cdots, f_n(x, \ldots, z) =0)\)
</p>

<blockquote>
<p>

</p>

<ul class="org-ul">
<li>変数消去, 因数分解</li>

<li>必ず解ける方法を知っていますか？</li>
</ul>
</blockquote></li>
</ul>
</div>

<div id="outline-container-org2359d76" class="outline-3">
<h3 id="org2359d76"><span class="section-number-3">1.1</span> 基底とは</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<ol class="org-ol">
<li><a id="org0c8fea5"></a>問題<br />
<div class="outline-text-5" id="text-1-1-0-1">
<blockquote>
<p>
天秤秤と, $a$グラムの重りと $b$グラムの重りが無数にあるとします.
どんな重さが測れるでしょう？
</p>

<p>
あるいは, \(c\) グラムを測る事ができますか？
</p>
</blockquote>

<ul class="org-ul">
<li>この問題は，不定方程式 hoge \(ax+by=c\) を満たす，整数 \(x\), \(y\) を求
める問題となる．</li>

<li>この解は，\(a\) と \(b\) の最大公約数を求める問題に帰着さ れます．</li>

<li>\(a\) と \(b\) の組合わせで作れる最小の数は，最大公約数であ
り，それの倍数しか\(a\) と \(b\) の組合わせでは作れません．</li>

<li>最大公約数は\(a\) と \(b\) の組合わせでできる数の集合の*基
底*となります．</li>

<li>上の問題は，\(a\) と \(b\) の最大公約数を\(g\) とすると，
\(c\) は \(g\) の倍数でなければ解が存在しないこと，\(a x + b y = g\)
の \(x\) と \(y\) は，Euclid の互除法によって求められます．</li>
</ul>
</div>
</li>

<li><a id="orgdfbd6cb"></a>問題<br />
<div class="outline-text-5" id="text-1-1-0-2">
<blockquote>
<p>
二つの方程式 \(f_1(x)=0, f_2(x)=0\) の共通根は？
</p>
</blockquote>

<p>
それぞれの方程式の根を求めて, 共通な根を求めてもいいですが,
</p>

<ul class="org-ul">
<li>上の議論から，二つの式 \(f_1(x), f_2(x)\) の組み合わせで できる,
最も簡単な(次数の低い)式 (基底) を求め, その根を求める.</li>

<li>基底は， \(f_1(x)\) と \(f_2(x)\) の最大公約多項式(\(g(x)\))となり,
\[A(x) f_1(x) + B(x) f_2(x) = g(x),\] \[\deg(A(x)) < \deg(f_2(x)),\]
\[\deg(B(x)) < \deg(f_1(x))\]</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org3d6e199" class="outline-3">
<h3 id="org3d6e199"><span class="section-number-3">1.2</span> 多変数方程式 をどう解くか?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
\[(f_1(x, \ldots, z) =0, \cdots, f_n(x, \ldots, z) =0)\]
</p>

<p>
に対し，\(f_1, \ldots, f_n\) を組合わせでできる任意の多項式
</p>

<p>
\[A_1(x, \ldots, z) f_1(x, \ldots, z) + \cdots + A_n(x, \ldots, z)
f_n(x, \ldots, z)\]
</p>

<p>
の集合を考えます．
</p>

<p>
この集合を$(f<sub>1</sub>, &#x2026; , f<sub>n</sub>)$と表し，$f<sub>1</sub>$から\(f_n\) が作る
*イデアル*${\cal I}$と呼ぶ．
</p>

<p>
${\cal I}$を作ることのできる多項式の組をイデアルの基底と呼びます．
</p>

<p>
方程式を解くのに都合の良い基底を求めることは，同じ根を持つ，より簡単な
方程式系への変換となる．
</p>

<p>
この基底が例えば，
</p>

<p>
\[(g_1(x, z) =0, g_2(y,z) = 0, \cdots, g_m(z) =0)\]
</p>

<p>
という形で求まれば，多変数方程式の問題は， 一変数方程式の
問題に帰着される．
</p>

<p>
「このような変形はできるのか」，「変形する方針は」，「必ず求まるのか」
などが問題となる．
</p>
</div>
</div>
</div>

<div id="outline-container-orgc6e64f1" class="outline-2">
<h2 id="orgc6e64f1"><span class="section-number-2">2</span> パズルと基底</h2>
<div class="outline-text-2" id="text-2">
</div>
<ol class="org-ol">
<li><a id="orgc48e303"></a>グラス置き換えパズル<br />
<div class="outline-text-5" id="text-2-0-0-1">
<p>
ウィスキーのグラス \(W\), ビールのグラス \(B\), お酒のグラス \(S\) が
一列に並んでいる.
</p>

<p>
グラスは次の置き換え規則で, 置き換えて良いとする.
</p>

<p>
\[置き換え規則 G \left\{ \begin{array}{rll}
B &  \leftarrow\rightarrow  &  W B\\
BS& \leftarrow\rightarrow   & W  \\
      \end{array}
\right.\]
</p>
</div>
</li>

<li><a id="org805a8ec"></a>問題<br />
<div class="outline-text-5" id="text-2-0-0-2">
<ol class="org-ol">
<li>\(BSBS\) は \(WWWB\) に置き換えできるか？</li>

<li>\(BSBBS\) は \(BWW\) に置き換えできるか？</li>
</ol>
</div>
</li>

<li><a id="org4abd5bd"></a>問題の難しい点<br />
<div class="outline-text-5" id="text-2-0-0-3">
<ul class="org-ul">
<li>できる場合はその置き換えを示せば良いが,</li>

<li>できない事を示す事.</li>
</ul>
</div>
</li>

<li><a id="org2eeae60"></a>パズル解法への道<br />
<div class="outline-text-5" id="text-2-0-0-4">
<ul class="org-ul">
<li>簡単な方へ置き換える (簡約化)ことにする.
\[簡約規則 R \left\{ \begin{array}{rll}
   WB & \rightarrow  &  B\\
   BS & \rightarrow   & W  \\
         \end{array}
   \right.\]</li>

<li>これ以上簡約できないもの (正規形)</li>

<li><p>
置き換え規則 \(G\) で置き換え可能な列の要素は 簡約規則 \(R\)
で同じ正規系を持つか？
</p>

<p>
この性質が成り立てば, 簡約系で正規形が同じであれば,
置き換え系で,置き換え可能となる.
</p></li>

<li><p>
置き換え可能なのに, 同じ正規形を持たない場合は,
そのような簡約規則を追加すればよい.
</p>

<p>
例えば, \(WBS\) は二つの
</p>

<p>
\[\left\{ \begin{array}{rllll}
   WBS & \rightarrow  &  WW\\
   WBS & \rightarrow   & BS & \rightarrow  & W\\
         \end{array}
   \right.\]
</p>

<p>
置き換え系では, \(WW\) と \(W\) は, \(WBS\) を通して置き換え可能である
から, 簡約系で
</p>

<p>
\[WW  \rightarrow   W\]
</p>

<p>
を新しい簡約規則として採用すればいい事になる.
</p>

<p>
この追加される簡約規則を同やって見付けるかが問題となる.
</p></li>

<li><p>
簡約規則の左項中で, 重なりが生ずるような二つの規則を探す.
(この二つの簡約規則を*危険対*と呼ぶ).
</p>

<p>
今の場合, \(BS\) と \(WB\) は 重なりを持つ項, \(WBS\) を別の正規形に簡
約する可能性を持つ.
</p></li>

<li>この操作を次々に繰り返し, 危険対が全て同じ簡約形を持つよう
になった時, 置き換え可能である物は, 全て同じ正規形を持つ事になる.</li>
</ul>

<p>
簡約系の*完備化*という.完備な系とは,
</p>

<ul class="org-ul">
<li>正規系は有限ステップで求まる. (<b>停止性</b>)</li>

<li>ある項の正規系は, 簡約順序によらず同じになる.(<b>合流性</b>)</li>
</ul>
</div>
</li>
