org/gbasis/gbasis.html

<li><a id="org89c2c36"></a>パズルの答え<br />
<div class="outline-text-5" id="text-2-0-0-5">
<p>
簡約規則 \(R\) を完備化すると,
</p>

<p>
\[簡約規則 R' \left\{ \begin{array}{rll}
WB & \rightarrow  &  B\\
BS & \rightarrow   & W  \\
WW & \rightarrow   & W  \\
      \end{array}
\right.\]
</p>

<p>
が得られる. これで, \(BSBS \rightarrow^* W\), \(WWWB \rightarrow^* B\),
なので,置き換え可能ではない.
</p>

<p>
\(BSBBS \rightarrow^* BW\), \(BWWW \rightarrow^* BW\),
なので,置き換え可能となる.
</p>

<p>
*これがどう方程式と関係しているのでしょう？ *
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org42e41ee" class="outline-2">
<h2 id="org42e41ee"><span class="section-number-2">3</span> グレブナー基底</h2>
<div class="outline-text-2" id="text-3">
<p>
与えられた方程式\(f_i\) の最高順位項を \(head(f_i)\) 、残りの項を
\(rest(f_i)\) とすると, \[f_i = head(g_i) + rest(g_i)  = 0\] から
\[head(g_i) \rightarrow - rest(g_i)\] という簡約規則を作る事ができる.
</p>

<p>
このような簡約系を作るには, 項間の順序, 簡約, 危険対の求め方を,
方程式用に決める必要がある.
</p>
</div>

<div id="outline-container-org57a65fd" class="outline-3">
<h3 id="org57a65fd"><span class="section-number-3">3.1</span> 項の間の順序</h3>
<div class="outline-text-3" id="text-3-1">
<p>
いくつの順序が考えられ, 順序によって完備な簡約系が異る.
</p>

<dl class="org-dl">
<dt>辞書式順序:</dt><dd>： \(xyz > yz^3 > z^5\)</dd>

<dt>全次数辞書式順序:</dt><dd>\(x^5 > x^4y > x^3yz\)</dd>
</dl>
</div>
</div>

<div id="outline-container-orgc01221e" class="outline-3">
<h3 id="orgc01221e"><span class="section-number-3">3.2</span> 簡約</h3>
<div class="outline-text-3" id="text-3-2">
<p>
基底の先頭項を残りの項で置き換える簡約規則と見て，
項をより低順位項で置き換える操作．
</p>

<p>
*例２.１:*　\(g_1\) を \(g_2\) でM簡約
</p>

<p>
$g<sub>1</sub> = x<sup>4yz</sup> - xyz<sup>2</sup>~~~(<code>head(g_1) = x^4yz~</code>,~~rest(g<sub>1</sub>) = xyz<sup>2</sup>~)~ $
</p>

<p>
$g<sub>2</sub> = x<sup>3yz</sup> - xz<sup>2</sup>~~~(<code>head(g_2) = x^3yz~</code>,~~rest(g<sub>2</sub>) = xz<sup>2</sup>)~ $
</p>

<p>
\[\begin{array}{ll}
g' & = g_1 - ( head(g_1) / head(g_2) ) g_2 \\
   & = g_1 - ( x^4yz / x^3yz ) g_2 \\
   & = x^2z^2 - xyz^2
\end{array}\]
</p>
</div>
</div>

<div id="outline-container-org73cd44f" class="outline-3">
<h3 id="org73cd44f"><span class="section-number-3">3.3</span> S多項式</h3>
<div class="outline-text-3" id="text-3-3">
<p>
新たな簡約規則を得るための計算．
</p>

<p>
２つの多項式$f<sub>1,f</sub><sub>2</sub>$のS多項式を$Sp(f<sub>1,f</sub><sub>2</sub>)$と書き、以下のように計算する。
</p>

<p>
\[Sp(f_1,f_2)= \frac{lcm}{head(f_1)}f_1 - \frac{lcm}{head(f_2)}f_2\]
</p>

<p>
*例２.２:*　$g<sub>1</sub>$と$g<sub>2</sub>$のS多項式
</p>

<p>
\(g_1 = x^3yz - xz^2,\ \   head(g_1) = x^3yz\)
</p>

<p>
\(g_2 = x^2y^2 - z^2,\ \  \  head(g_2) = x^2y^2\)
</p>

<p>
\(lcm(head(g_1), head(g_2)) = x^3y^2z\)
</p>

<p>
\[\begin{array}{ll} 
Sp(g_1,g_2) &= ( lcm / head(g_1) ) g_1 - ( lcm / head(g_1)) g_2 \\
            &= ( x^3y^2z / x^3yz ) g_1 - ( x^3y^2z / x^2y^2 ) g_2 \\
            &= -xyz^2 + xz^3
\end{array}\]
</p>
</div>
</div>

<div id="outline-container-org5701255" class="outline-3">
<h3 id="org5701255"><span class="section-number-3">3.4</span> グレブナー基底の定義</h3>
<div class="outline-text-3" id="text-3-4">
<p>
イデアル${\cal I}\(の基底を\) G = \{ f<sub>1,&ctdot;,f</sub><sub>n</sub> \} $とする。
</p>

<p>
$F$を可能な限りM簡約した結果を$F'$とし，
</p>

<p>
\[F \stackrel{G}{\longmapsto} F'\] と表す.
</p>

<p>
${\cal I}$の任意の要素 $f$に対し，
</p>

<p>
\[f \stackrel{G}{\longmapsto} 0\]
という性質を持つとき，$ G $をグレブナー基底と呼ぶ。
</p>

<p>
$ G $がグレブナー基底の時，$f \stackrel{\psi}{\longmapsto} f' $を計算
し，$f'=0$を調べることで、$f &isin; {\cal I}$であるかを簡単に決定できる.
</p>

<p>
<b>例２.３: \(f_1,f_2,f_3\) のグレブナー基底を求める。(全次数辞書式順序）</b>
</p>

<p>
$$\left\{
</p>
\begin{array}{l}
f_1 = 2{x_1}^3x_2 +6{x_1}^3-2{x_1}^2-x_1x_2-3x_1-x_2+3\vspace{.2in}\\
f_2 = {x_1}^3x_2 + 3{x_1}^3 + {x_1}^2x_2 + 2{x_1}^2\vspace{.2in}\\
f_3 = 3{x_1}^2x_2 + 9{x_1}^2 + 2x_1x_2 + 5x_1 + x_2 -3
\end{array}
<p>
\right.$$
</p>

<p>
(ｓ多項式の例）
</p>

<p>
\(\begin{array}{ll} 
Sp(f_1,f_2) &= ( lcm / head(f_1) ) f_1 - ( lcm / head(f_1)) f_2 \\
            &= ( 2{x_1}^3x_2 / 2{x_1}^3x_2 ) f_1 - ( 2{x_1}^3x_2 / {x_1}^3x_2 ) f_2 \\
        &= -2x_1^2 x_2 -6x_1^2 -x_1 x_2 - 3x_1 -x_2 +3 = f'_4
\end{array}\)
</p>

<p>
（Ｍ簡約の例）
</p>

<p>
\(\begin{array}{lll}
f'_4 & \stackrel{f_3}{\longmapsto} & f'_4 - (-2x_1^2 x_2 /{head(f_3)})f_3 \\
     & = & x_1 x_2+ x_1 -x_2 +3
\end{array}\)
</p>

<p>
＜\(f_1,f_2,f_3\) のグレブナー基底＞
\[G = [x_1 x_2 + x_1- x_2 + 3, 2{x_1}^2 - 3 x_1 + 2 x_2 - 6, 
    2{x_2}^2 - 8 x_1 - 5 x_2 -3]\]
</p>
</div>
</div>
</div>

<div id="outline-container-org4d59f10" class="outline-2">
<h2 id="org4d59f10"><span class="section-number-2">4</span> グレブナー基底から方程式の根を求める方法</h2>
<div class="outline-text-2" id="text-4">
<p>
辞書式順序で基底計算を行うと、連立方程式の解が求めやすいが、
基底計算に時間がかかる上に計算量が多くなる．
</p>

<p>
簡単に求まる基底から，根を求める手法として固有値法がある.
</p>

<ol class="org-ol">
<li>任意の多項式を, グレブナー基底 \(G\) で簡約した多項式の集合
\({\cal P}^s /{\cal I}\) は, ベクトル空間をなす．</li>

<li>グレブナー基底の最高順位項で割り切れない全ての項の集合を Normal
setといい、 \({\cal P}^s /{\cal I}\) ベクトル空間の基底となる。</li>

<li>Normal set により $x<sub>i</sub> &times; $ を行列で表す事ができる.</li>

<li>その行列の固有値は, \({\cal I}\) の\(x_i\) に関する根となる．</li>
</ol>

<p>
<b>例３.１:</b> 例２.３の \(f_1,f_2,f_3\) の根を求める。
</p>

<p>
＜\(f_1,f_2,f_3\) のグレブナー基底＞
\[G = [x_1 x_2 + x_1 - x_2 + 3, 2{x_1}^2-3x_1+2x_2-6,2{x_2}^2-8x_1-5x_2-3]\]
</p>

<p>
\[Normal \; Set =  \{1,x_2,x_1\}\]
</p>

<p>
＜書き換え規則＞
</p>

<p>
$$\left\{
</p>
\begin{array}{rl}
x_1x_2 & \rightarrow  -x_1+x_2-3\vspace{.15in}\\
{x_1}^2 & \rightarrow  \frac{3}{2}x_1-x_2+3\vspace{.15in}\\
{x_2}^2 & \rightarrow  4x_1+\frac{5}{2}x_2+\frac{3}{2}
\end{array}
<p>
\right.$$
</p>

<p>
\(P=c_1\vec{x_1} + c_2\vec{x_2} + c_3\)
</p>

<p>
＜$x<sub>1</sub> &times; $ の行列＞
</p>

<p>
\[\bordermatrix{
    &  1 & x_2 & x_1\cr
    1   &  0 &  0 &  1 \cr
    x_2 & -3 &  1 & -1 \cr
    x_1 &  3 & -1 & 3/2 \cr
}\]
</p>

<p>
＜$x<sub>2</sub> &times; $ の行列＞
</p>

<p>
\[\bordermatrix{
    &  1 & x_2 & x_1\cr
    1   &  0  &  1  &  0 \cr
    x_2 & 3/2 & 5/2 &  4 \cr
    x_1 & -3  &  1  & -1 \cr
}\]
</p>

<p>
＜\(x_1\) の固有値＞
</p>

<p>
\[\left[ 0, \; \frac{5}{4}+\frac{1}{4}\sqrt{65},
\; \frac{5}{4}-\frac{1}{4}\sqrt{65}\right]\]
</p>

<p>
＜\(x_2\) の固有値＞
</p>

<p>
\[\left[ 3, \; -\frac{3}{4}+\frac{1}{4}\sqrt{65},
\; -\frac{3}{4}-\frac{1}{4}\sqrt{65}\right]\]
</p>

<p>
これらの固有値が \(f_1,f_2,f_3\) の根である。
</p>
</div>
</div>

<div id="outline-container-org1232e1f" class="outline-2">
<h2 id="org1232e1f"><span class="section-number-2">5</span> Buchberger算法と並列化</h2>
<div class="outline-text-2" id="text-5">
<p>
以下に，\(f_1, \ldots, f_l\) が作るイデアルの Gröbner基底を計算する
Buchberger算法を示す．
</p>
</div>

<ol class="org-ol">
