org/working/gbasis.tex

\paragraph{パズルの答え}
\label{sec:org32d9f9d}

簡約規則 \(R\) を完備化すると,

$$簡約規則 R' \left\{ \begin{array}{rll}
WB & \rightarrow  &  B\\
BS & \rightarrow   & W  \\
WW & \rightarrow   & W  \\
      \end{array}
\right.$$

が得られる. これで, \(BSBS \rightarrow^* W\), \(WWWB \rightarrow^* B\),
なので,置き換え可能ではない.

\(BSBBS \rightarrow^* BW\), \(BWWW \rightarrow^* BW\),
なので,置き換え可能となる.

*これがどう方程式と関係しているのでしょう？ *

\section{グレブナー基底}
\label{sec:org073a21e}

与えられた方程式\(f_i\) の最高順位項を \(head(f_i)\) 、残りの項を
\(rest(f_i)\) とすると, $$f_i = head(g_i) + rest(g_i)  = 0$$ から
$$head(g_i) \rightarrow - rest(g_i)$$ という簡約規則を作る事ができる.

このような簡約系を作るには, 項間の順序, 簡約, 危険対の求め方を,
方程式用に決める必要がある.

\subsection{項の間の順序}
\label{sec:org5f3ddbf}

いくつの順序が考えられ, 順序によって完備な簡約系が異る.

\begin{description}
\item[{辞書式順序:}] ： \(xyz > yz^3 > z^5\)

\item[{全次数辞書式順序:}] \(x^5 > x^4y > x^3yz\)
\end{description}

\subsection{簡約}
\label{sec:org1d26261}

基底の先頭項を残りの項で置き換える簡約規則と見て，
項をより低順位項で置き換える操作．

\begin{itemize}
\item 例２.１:: \(g_1\) を \(g_2\) でM簡約

\(g_1 = x^4yz - xyz^2~~~(~head(g_1) = x^4yz~~,~~rest(g_1) = xyz^2~)~\)

\(g_2 = x^3yz - xz^2~~~(~head(g_2) = x^3yz~~,~~rest(g_2) = xz^2)~\)
\end{itemize}

$$\begin{array}{ll}
g' & = g_1 - ( head(g_1) / head(g_2) ) g_2 \\
   & = g_1 - ( x^4yz / x^3yz ) g_2 \\
   & = x^2z^2 - xyz^2
\end{array}$$

\subsection{S多項式}
\label{sec:orgd737c89}

新たな簡約規則を得るための計算．

２つの多項式 \(f_1,f_2\) のS多項式を \(Sp(f_1,f_2)\) と書き、以下のように計算する。

$$Sp(f_1,f_2)= \frac{lcm}{head(f_1)}f_1 - \frac{lcm}{head(f_2)}f_2$$

\begin{itemize}
\item 例２.２:: \(g_1\) と \(g_2\) のS多項式

\(g_1 = x^3yz - xz^2,\ \   head(g_1) = x^3yz\)

\(g_2 = x^2y^2 - z^2,\ \  \  head(g_2) = x^2y^2\)

\(lcm(head(g_1), head(g_2)) = x^3y^2z\)

$$\begin{array}{ll} 
  Sp(g_1,g_2) &= ( lcm / head(g_1) ) g_1 - ( lcm / head(g_1)) g_2 \\
            &= ( x^3y^2z / x^3yz ) g_1 - ( x^3y^2z / x^2y^2 ) g_2 \\
            &= -xyz^2 + xz^3
  \end{array}$$
\end{itemize}

\subsection{グレブナー基底の定義}
\label{sec:orgb27a5db}

イデアル \({\cal I}\) の基底を \(G={f_1,\cdots,f_n}\) とする。

\(F\) を可能な限りM簡約した結果を \(F'\) とし，

$$F \stackrel{G}{\longmapsto} F'$$ と表す.

\({\cal I}\) の任意の要素 \$f\$に対し，

$$f \stackrel{G}{\longmapsto} 0$$
という性質を持つとき，\(G\) をグレブナー基底と呼ぶ。

\(G\) がグレブナー基底の時，\(f \stackrel{\psi}{\longmapsto} f'\) を計算
し，\(f'=0\) を調べることで、\(f \in {\cal I}\) であるかを簡単に決定できる.

\begin{description}
\item[{例２.３}] \(f_1,f_2,f_3\) のグレブナー基底を求める。(全次数辞書式順序）*
\end{description}

\$\$\left$\backslash${
\begin{array}{l}
f_1 = 2{x_1}^3x_2 +6{x_1}^3-2{x_1}^2-x_1x_2-3x_1-x_2+3\vspace{.2in}\\
f_2 = {x_1}^3x_2 + 3{x_1}^3 + {x_1}^2x_2 + 2{x_1}^2\vspace{.2in}\\
f_3 = 3{x_1}^2x_2 + 9{x_1}^2 + 2x_1x_2 + 5x_1 + x_2 -3
\end{array}
\right.\$\$

(ｓ多項式の例）

\(\begin{array}{ll} 
Sp(f_1,f_2) &= ( lcm / head(f_1) ) f_1 - ( lcm / head(f_1)) f_2 \\
            &= ( 2{x_1}^3x_2 / 2{x_1}^3x_2 ) f_1 - ( 2{x_1}^3x_2 / {x_1}^3x_2 ) f_2 \\
        &= -2x_1^2 x_2 -6x_1^2 -x_1 x_2 - 3x_1 -x_2 +3 = f'_4
\end{array}\)

（Ｍ簡約の例）

\(\begin{array}{lll}
f'_4 & \stackrel{f_3}{\longmapsto} & f'_4 - (-2x_1^2 x_2 /{head(f_3)})f_3 \\
     & = & x_1 x_2+ x_1 -x_2 +3
\end{array}\)

＜\(f_1,f_2,f_3\) のグレブナー基底＞
$$G = [x_1 x_2 + x_1- x_2 + 3, 2{x_1}^2 - 3 x_1 + 2 x_2 - 6, 
    2{x_2}^2 - 8 x_1 - 5 x_2 -3]$$

\section{グレブナー基底から方程式の根を求める方法}
\label{sec:org12ab7ed}

辞書式順序で基底計算を行うと、連立方程式の解が求めやすいが、
基底計算に時間がかかる上に計算量が多くなる．

簡単に求まる基底から，根を求める手法として固有値法がある.

\begin{enumerate}
\item 任意の多項式を, グレブナー基底 \(G\) で簡約した多項式の集合
\({\cal P}^s /{\cal I}\) は, ベクトル空間をなす．

\item グレブナー基底の最高順位項で割り切れない全ての項の集合を Normal
setといい、 \({\cal P}^s /{\cal I}\) ベクトル空間の基底となる。

\item Normal set により \(x_i \times\) を行列で表す事ができる.

\item その行列の固有値は, \({\cal I}\) の \(x_i\) に関する根となる．
\end{enumerate}

\textbf{例３.１:} 例２.３の \(f_1,f_2,f_3\) の根を求める。

＜\(f_1,f_2,f_3\) のグレブナー基底＞
$$G = [x_1 x_2 + x_1 - x_2 + 3, 2{x_1}^2-3x_1+2x_2-6,2{x_2}^2-8x_1-5x_2-3]$$

$$Normal \; Set =  \{1,x_2,x_1\}$$

＜書き換え規則＞

\$\$\left\{
\begin{array}{rl}
x_1x_2 & \rightarrow  -x_1+x_2-3\\
{x_1}^2 & \rightarrow  \frac{3}{2}x_1-x_2+3\\
{x_2}^2 & \rightarrow  4x_1+\frac{5}{2}x_2+\frac{3}{2}
\end{array}
\right.\$\$

\(P=c_1\vec{x_1} + c_2\vec{x_2} + c_3\)

＜\(x_1 \times\) の行列＞

$$\begin{array}{c|ccc}
    &  1 & x_2 & x_1\cr
    \hline
    1   &  0 &  0 &  1 \cr
    x_2 & -3 &  1 & -1 \cr
    x_1 &  3 & -1 & 3/2 \cr
\end{array}$$

＜ \(x_2 \times\) の行列＞

$$\begin{array}{c|c c c}
    &  1 & x_2 & x_1\cr
    \hline
    1   &  0  &  1  &  0 \cr
    x_2 & 3/2 & 5/2 &  4 \cr
    x_1 & -3  &  1  & -1 \cr
\end{array}$$

＜\(x_1\) の固有値＞

$$\left[ 0, \; \frac{5}{4}+\frac{1}{4}\sqrt{65},
\; \frac{5}{4}-\frac{1}{4}\sqrt{65}\right]$$

＜\(x_2\) の固有値＞

$$\left[ 3, \; -\frac{3}{4}+\frac{1}{4}\sqrt{65},
\; -\frac{3}{4}-\frac{1}{4}\sqrt{65}\right]$$

これらの固有値が \(f_1,f_2,f_3\) の根である。

\section{Buchberger算法と並列化}
\label{sec:orgd5a6fbc}

以下に，\(f_1, \ldots, f_l\) が作るイデアルの Gröbner基底を計算する
Buchberger算法を示す．
