org/gbasis/gbasis.html
<li><a id="orgc91af09"></a>Buchberger算法<br />
<div class="outline-text-5" id="text-5-0-0-1">
<blockquote>
<p>
Input: $F = \{ f<sub>1</sub>, \ldots, f<sub>l</sub>\}$<br />
Output: Gröbner基底 \(G\) of \(Ideal(F)\)
</p>

<p>
#+BEGIN<sub>QUOTE</sub>
  \(PairQ \longleftarrow \phi\);<br />
  \(G \longleftarrow \phi\);
</p>

<p>
<i>foreach</i> (\(f_i \in F\)) \(\{\)
</p>

<p>
#+BEGIN<sub>QUOTE</sub>
  $ PairQ \longleftarrow UpdatePairQ(PairQ, f<sub>i</sub>, F)$;<br />
  $ G \longleftarrow UpdateBase(G, f<sub>i</sub>)$;
</p>
</blockquote>

<p>
\(\}\)
</p>

<p>
<i>while</i> ( \(PairQ \ne \phi\) ) \(\{\)
</p>

<blockquote>
<p>
\((g_i, g_j) \longleftarrow\) <i>select an element of \(PairQ\)</i>;<br />
\(PairQ \longleftarrow PairQ \setminus \{(g_i, g_j)\}\);<br />
\(g_k \longleftarrow {{{\mathrm{SPOL}}(g_i, g_j)\!\downarrow_{G}}}\);
</p>

<p>
<i>if</i> $g<sub>k</sub> &ne; 0 $ \(\{\)
</p>

<p>
#+BEGIN<sub>QUOTE</sub>
  \(PairQ \longleftarrow UpdateQ(PairQ, g_k, G)\);<br />
  \(G \longleftarrow UpdateBase(G, g_k)\);
</p>
</blockquote>

<p>
  \(\}\)
#+END<sub>QUOTE</sub>
</p>

<p>
    \(\}\)
  #+END<sub>QUOTE</sub>
#+END<sub>QUOTE</sub>
</p>
</div>
</li>

<li><a id="org527314d"></a>算法の概要と戦術<br />
<div class="outline-text-5" id="text-5-0-0-2">
<ul class="org-ul">
<li>$G$は中間的な基底の集合，\(PairQ\) は新たな基底を構成可能な
中間基底の組 (<b>ペア</b>)の集合，を表している．</li>

<li>\(PairQ\) から一つのペア \((g_i, g_j)\) を選ぶ．
この選び方を選択戦術と呼ぶ．</li>

<li>\({\mathrm{SPOL}}(g_i, g_j)\) の現在の中間基底での正規形$g<sub>k</sub>$を求める．
簡約基底の選び方の順序や簡約法を簡約化戦術と呼ぶ．</li>

<li>$g<sub>k</sub>$が0でなければ，

<ul class="org-ul">
<li>ペア削除戦術により，新たなペアの生成と，不必要なペアの削除をお
こない(\(UpdateQ\))，</li>

<li>中間基底に追加し，基底削除戦術により不必要な中間基底の削除をおこ
なう (\(UpdateBase\))，</li>
</ul></li>

<li>\(PairQ\) が空になった時点で算法は停止し， \(G\) に Gröbner
基底が求まる．</li>
</ul>
</div>
</li>
</ol>

<div id="outline-container-org78a3ec3" class="outline-3">
<h3 id="org78a3ec3"><span class="section-number-3">5.1</span> Buchberger算法の並列性</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Buchberger算法の計算上の問題点は，ペアの個数の組み合わせ的な膨張と，中
間基底の数係数の膨張である．ペアの個数の膨張を防ぐために，いくつかの選
択戦術が考えられており，選択戦術を保持したまま，ペアの個数に関する並列
性の導入が必要となる \cite{strategy-accurate}．
</p>

<p>
野呂ら\cite{noro97-ap}は, 数係数の膨張による計算時間の増大を，並列計算
により減らせることを示した．筆者\cite{asir-para}は，共有メモリを用いて
更に高速化を行った．一つの基底によるS多項式の簡約
(\({{{\mathrm{SPOL}}(g_i, g_j)\!\downarrow_{\{g_k\}}}}\))
を${\mathrm{SPOL}}(g<sub>i</sub>, g<sub>j</sub>)$や$g<sub>k</sub>$を分割
し，並列計算する．これを*一簡約並列*と呼ぶ．この方式では，
</p>

<ul class="org-ul">
<li>全ての戦術を保持したまま並列計算が可能であるが,</li>

<li>細粒度の並列化であり，有効となるのは数係数が大きくなった場合に限る，</li>

<li>逐次部分が残る．</li>
</ul>

<p>
この方式は，大規模なGröbner基底計算\cite{noro97-mckay}において，並
列度が中規模($ &le; 20$) 程度であれば良い性能を示している
\cite{noro97-ap,asir-para}．しかし計算の逐次部分，通信コストのために，
性能限界を持つ．
</p>

<p>
\cite{strategy-accurate}では，
選択戦術を忠実に守りつつ，ペアに関する簡約
(\({{{\mathrm{SPOL}}(g_i,g_j)\!\downarrow_{G}}}\))
を並列に行っている．$G$を共有し，複
数のワーカが別々の簡約を行う．以後，この並列化を*ペア並列*と呼ぶ．
ペア並列では，
</p>

<ul class="org-ul">
<li>逐次部分がないが，</li>

<li>中間基底の生成順序を保つため，S多項式の生成，簡約化に待ち が生ずる，</li>

<li>無駄な計算 (0簡約される基底を用いたペア)が生ずる．</li>
</ul>

<p>
この方式では, 中間基底の生成順序による待ちがボトルネックとなり，
様々な問題に対して性能限界が生じることが報告されている．
この論文中，斉次な基底計算の場合，生成順序による待ちが大幅に減らせ，
高い並列性能を示すことが言及されているが，その性能は示されていない．
</p>
</div>
</div>
</div>

<div id="outline-container-orgaa3d3ca" class="outline-2">
<h2 id="orgaa3d3ca"><span class="section-number-2">6</span> 並列算法の組合わせによる並列度の向上</h2>
<div class="outline-text-2" id="text-6">
<p>
前章の二つの並列化算法はそれぞれ性能限界を持つ．
しかし，その限界を持つ原因は異なるので，二つを組み合わせることにより，
並列性能向上が期待できる．
</p>

<p>
提案する算法の基本的な考え方は，
</p>

<ul class="org-ul">
<li>ペア並列度を検出し，</li>

<li>ペア並列度が低い場合に，一簡約並列を行う</li>
</ul>

<p>
であるが，ペア並列度の検出は計算中には行えない．そこで，
まず同じ戦術のmodular 計算を行い，
0簡約される基底，基底の生成順序と簡約依存性をあらかじめ求める．
この手法は，\cite{para-gb}で用いられていて，ペア並列度は低いことが
報告されている．つまり，ペア並列度だけでは高い性能向上は見込めない．
そこで，
</p>

<ul class="org-ul">
<li>modular 計算により基底の生成順序と簡約依存性をあらかじめ求め，
並列計算可能なブロックに分ける．(これを*並列計算のシナリオ*と呼ぶ)</li>

<li>シナリオにより，ブロック内をペア並列実行するが，並列度が投入でき
るプロセッサ台数より小さい場合，全プロセッサが計算に参加できるように，
一簡約並列を併用する．</li>
</ul>
</div>
</div>

<div id="outline-container-orgd711521" class="outline-2">
<h2 id="orgd711521"><span class="section-number-2">7</span> $\mathbf{d}$-Gröbner 基底によるペア並列度の向上</h2>
<div class="outline-text-2" id="text-7">
<p>
選択戦術として斉次化あるいはsugar を用いる場合には，
あらかじめ決めることができるペア並列度が存在する．
</p>
</div>

<div id="outline-container-orgc1a35d7" class="outline-3">
<h3 id="orgc1a35d7"><span class="section-number-3">7.1</span> $\mathbf{d}$-グレブナー基底</h3>
<div class="outline-text-3" id="text-7-1">
<p>
S多項式の全次数(またはsugar次数) \(d\) で打ち切った Buchberger
算法の結果を \(G_d\) とする．この$G<sub>d</sub>$のことを*$d$-グレブナー基底*
という．
</p>

<p>
[th-d] 斉次多項式 \(f_1, \ldots, f_n\)
に対する$d$-グレブナー基底は以下の性質 を持つ：
</p>

<ol class="org-ol">
<li>$&deg;(f) &lt; d $ な \(f\) に対し,
\({{\!\stackrel{G_d}{\longrightarrow^{*}} }}\) が定義さ れる．</li>

<li>\(\forall p \in {\mathcal{I}} \ \deg(p) \le d\) \(\Rightarrow\)
\({{p\!\stackrel{G_d}{\longrightarrow^{*}} 0}}\)</li>

<li>\(\forall f, g \in G_d\)
$&deg;({\mathrm{HT}}(f),{\mathrm{HT}}(g)) &le; d $に対し，
\({{{\mathrm{SPOL}}(f, g)\!\stackrel{G_d}{\longrightarrow^{*}} 0}}\)</li>
</ol>

<p>
\(\forall d > d_\infty \ G_d = G_{d_\infty}\) となる
$d<sub>&infin;</sub>$が存在する． □
</p>

<p>
任意の多項式に対し，定理[th-d]の$&deg;$を\(\deg_S\) で置き換えて，性 質 1,
2, 3 および\(d_{infty}\) の存在が成り立つ．
</p>

<p>
定理より$d$-グレブナー基底は，
</p>

<p>
\[G_0 \rightarrow
G_1 \rightarrow
\cdots \rightarrow
G_{d} \rightarrow 
G_{d+1} \rightarrow 
\cdots \rightarrow
G_{d_\infty} = \cdots\]
</p>

<p>
のように計算でき，\(G_d = G_{d-1} + \{d\mbox{-次式}\}\) となる．
</p>
</div>
</div>

<div id="outline-container-org8fd84fe" class="outline-3">
<h3 id="org8fd84fe"><span class="section-number-3">7.2</span> $\mathbf{d}$-グレブナー基底の並列性</h3>
<div class="outline-text-3" id="text-7-2">
<p>
前節の定理より，$G<sub>d-1</sub>$が求まっていて，$G<sub>d</sub>$を求める場合は，
次の事が言える．
</p>

<ol class="org-ol">
<li>\(G_d\) に追加される基底は， \({\mathrm{SPOL}}(g_i, g_j)\),
\(g_i, g_j \in G_{d-1}\), より作られ，基底候補のS多項式に依存性はない．</li>

<li>\({{{\mathrm{SPOL}}(g_i, g_j)\!\downarrow_{G_{d-1}}}}\) の計算にも
依存性はない．</li>

<li>上の計算後，\({{{\mathrm{SPOL}}(g_i, g_j)\!\downarrow_{G_{d}}}}\)
の計算は， 1,2 で作られた $d$-次基底のみの相互簡約で求められる．</li>
</ol>

<p>
つまり，S多項式の並列生成，$G<sub>d-1</sub>$に関する並列簡約，が可能である．
$d$-次基底の相互簡約には基底間の依存性が存在するが，
これは一簡約並列実行可能である．
</p>
</div>
</div>
</div>
