org/gbasis/gbasis.org
* 実装と性能(予測)

前章により，斉次あるいはsugar を用いた並列算法は，

-  modular 計算によりシナリオを作成し，

-  $d$-のS多項式 $s_i$を並列生成し,

-  ${{s_i\!\downarrow_{G_{d-1}}}}$ を並列計算する．ペア並列度が足りな
   い場合に，一簡約並列を併用する．

-  ${{s_i\!\downarrow_{G_{d-1}}}}$同士の相互簡約を一簡約並列計算する．

となる．asir 上で逐次版の$d$-グレブナー基底計算を実装し，その実行過
程を検討し，並列版を現在実装中である．

表[tab-1]に，McKay\cite{noro97-mckay}問題に対し，選択戦術としてsugar戦術をもちいて
実行した結果をしめす．8台の場合の一簡約並列性能は，5.6, ほぼ7割である．
表中の基底数が，シナリオを用いて計算した場合の
ペアの並列度になる．計算時間のもっともかかる，sugar値15,
16辺りのペア並列 度はかなり大きい．sugar値17以上では,
ペアの並列度は1で，ペア並列だけで
は十分な性能向上ははかれないことがわかる．

rrr sugar値& 基底数& 時間\\
11 & 14 & 21.22\\
12 & 24 & 89.32\\
13 & 37 & 359.4\\
14 & 63 & 2962\\
15 & 101 & 84620\\
16 & 168 & 572100\\
17 & 1 & 28900\\
18 & 1 & 12800\\
20 & 1 & 30000\\
total & 442 & 731800\\

[tab-1]

表[tab-2]に，同じ問題の modular基底を，$d$-Gröbner基底算法を用
いて計算した結果を，asir のgr\_mod\_main, F$_4$ の結果とともに示す．括
弧内は g.c. 時間である．
この計算は並列化のシナリオを作成する部分に相当する． まだ asir F$_4$
の性能には及ばないが，gr\_mode\_mainに比べて数割早くなってい
ることがわかる．

rr|rr|rr & &\\
180 & (409) & 240 & () & 126 & (432)\\

[tab-2]

表[tab-3]に，$d$-グレブナー基底計算中の各S多項式の$G_{d-1}$に関する簡約時間，
$d$-次の基底間の相互簡約にかかる時間を示す．
$G_{d-1}$に関する簡約時間が支配的であり，並列化した場合，ペア並列度
が実行時間に大きく寄与することがわかる．

r|rr|rr|rr & & &\\
total &180.7 & (409.3)& 148.1 & (321.2)& 32.2 & ( 87.3)\\
11& 0.8 & ( 3.3)& 0.7 & ( 3.1)& 0.1 & ( 0.2)\\
12& 2.5 & ( 9.6)& 2.2 & ( 8.4)& 0.3 & ( 1.2)\\
13& 7.6 & ( 27.7)& 6.8 & ( 24.5)& 0.8 & ( 3.2)\\
14&19.4 & ( 58.7)& 16.6 & ( 49.4)& 2.7 & ( 9.1)\\
15&48.7 & (134.4)& 39.6 & (104.3)& 9.0 & ( 29.8)\\
16&74.6 & (150.3)& 54.9 & (106.2)& 19.4 & ( 43.6)\\
17&25.2 & ( 22.7)& 25.2 & ( 22.7)& 0.0 & ( 0.0)\\
18&1.0 & ( 0.9)& 1.0 & ( 0.9)& 0.0 & ( 0.0)\\
19&0.1 & ( 0.0)& 0.1 & ( 0.0)& 0.0 & ( 0.0)\\
20& 0.3 & (0.2)& 0.3 & (0.2)& 0.0 & ( 0.0)\\
21& 0.4 & ( 0.3)& 0.4 & ( 0.3)& 0.0 & ( 0.0)\\

[tab-3]

一簡約並列算法(共有メモリ版)の性能は，12のプロセッサで8程度の並列性能
を得ている\cite{asir-para}．$d$-グレブナー基底計算の並列版は実装中で
あるので，算法の組合わせによる全体性能を示すことはできないが，相互簡約
の部分の並列化，ペア並列性の低い部分，が高速化でき，良い性能が得られる
ることは明らかだろう．

para-asir

Attardi, G., Tracerso, C.,: Strategy--Accurate Parallel Buchberger
Algorithms, J.Symb. Comp., 21/4-6 (1997), 411--426

Beker,T., Weispfenning, V.: Gröbner Bases. GTM bf 141, Springer-Verlag,
1993

Faugére, J.C.: Parallelization of Gröbner basis /Proc. PASCO'94/, 1994,
124--132

Faugére, J.C.: A new efficient algorithm for computing Gröbner bases
($F_4$), /Journal of Pure and Applied Algebra/ *139*(1--3), 1999, 61--88

Giovini, A., Mora, T., Niesi, G., Robbiano, L., Traverso, C.: "One sugar
cube, please" OR Slection strategies in the Buchberger algorithm, Proc.
ISSAC'91, 1991, 49--54

Noro, M., Kando, T., Takeshima, T.: Solving a large scale problem by
parallel algebraic computation on AP3000, /Research Report ISIS-RR-97/,
FUJITSU LABS, 1997

Noro, M., Mckay, J.: Computation of replicable functions on Risa/Asir,
/Proc. PASCO'97/, ACM Press, 1997, 130--138

鈴木正幸: 分散共有メモリを用いた並列Gröbner基底計算の性能評価,
第8回数式処理大会, 1999
