org/gbasis/gbasis.html

<div id="outline-container-org58ec836" class="outline-2">
<h2 id="org58ec836"><span class="section-number-2">8</span> 実装と性能(予測)</h2>
<div class="outline-text-2" id="text-8">
<p>
前章により，斉次あるいはsugar を用いた並列算法は，
</p>

<ul class="org-ul">
<li>modular 計算によりシナリオを作成し，</li>

<li>$d$-のS多項式 $s<sub>i</sub>$を並列生成し,</li>

<li>\({{s_i\!\downarrow_{G_{d-1}}}}\) を並列計算する．ペア並列度が足りな
い場合に，一簡約並列を併用する．</li>

<li>${{s<sub>i</sub>\!&darr;<sub>G<sub>d-1</sub></sub>}}$同士の相互簡約を一簡約並列計算する．</li>
</ul>

<p>
となる．asir 上で逐次版の$d$-グレブナー基底計算を実装し，その実行過
程を検討し，並列版を現在実装中である．
</p>

<p>
表[tab-1]に，McKay\cite{noro97-mckay}問題に対し，選択戦術としてsugar戦術をもちいて
実行した結果をしめす．8台の場合の一簡約並列性能は，5.6, ほぼ7割である．
表中の基底数が，シナリオを用いて計算した場合の
ペアの並列度になる．計算時間のもっともかかる，sugar値15,
16辺りのペア並列 度はかなり大きい．sugar値17以上では,
ペアの並列度は1で，ペア並列だけで
は十分な性能向上ははかれないことがわかる．
</p>

<p>
rrr sugar値&amp; 基底数&amp; 時間<br />
11 &amp; 14 &amp; 21.22<br />
12 &amp; 24 &amp; 89.32<br />
13 &amp; 37 &amp; 359.4<br />
14 &amp; 63 &amp; 2962<br />
15 &amp; 101 &amp; 84620<br />
16 &amp; 168 &amp; 572100<br />
17 &amp; 1 &amp; 28900<br />
18 &amp; 1 &amp; 12800<br />
20 &amp; 1 &amp; 30000<br />
total &amp; 442 &amp; 731800<br />
</p>

<p>
[tab-1]
</p>

<p>
表[tab-2]に，同じ問題の modular基底を，$d$-Gröbner基底算法を用
いて計算した結果を，asir のgr\<sub>mod</sub>\<sub>main</sub>, F\(_4\) の結果とともに示す．括
弧内は g.c. 時間である．
この計算は並列化のシナリオを作成する部分に相当する． まだ asir F\(_4\)
の性能には及ばないが，gr\<sub>mode</sub>\<sub>mainに比べて数割早くなってい</sub>
ることがわかる．
</p>

<p>
rr|rr|rr &amp; &amp;<br />
180 &amp; (409) &amp; 240 &amp; () &amp; 126 &amp; (432)<br />
</p>

<p>
[tab-2]
</p>

<p>
表[tab-3]に，$d$-グレブナー基底計算中の各S多項式の$G<sub>d-1</sub>$に関する簡約時間，
$d$-次の基底間の相互簡約にかかる時間を示す．
$G<sub>d-1</sub>$に関する簡約時間が支配的であり，並列化した場合，ペア並列度
が実行時間に大きく寄与することがわかる．
</p>

<p>
r|rr|rr|rr &amp; &amp; &amp;<br />
total &amp;180.7 &amp; (409.3)&amp; 148.1 &amp; (321.2)&amp; 32.2 &amp; ( 87.3)<br />
11&amp; 0.8 &amp; ( 3.3)&amp; 0.7 &amp; ( 3.1)&amp; 0.1 &amp; ( 0.2)<br />
12&amp; 2.5 &amp; ( 9.6)&amp; 2.2 &amp; ( 8.4)&amp; 0.3 &amp; ( 1.2)<br />
13&amp; 7.6 &amp; ( 27.7)&amp; 6.8 &amp; ( 24.5)&amp; 0.8 &amp; ( 3.2)<br />
14&amp;19.4 &amp; ( 58.7)&amp; 16.6 &amp; ( 49.4)&amp; 2.7 &amp; ( 9.1)<br />
15&amp;48.7 &amp; (134.4)&amp; 39.6 &amp; (104.3)&amp; 9.0 &amp; ( 29.8)<br />
16&amp;74.6 &amp; (150.3)&amp; 54.9 &amp; (106.2)&amp; 19.4 &amp; ( 43.6)<br />
17&amp;25.2 &amp; ( 22.7)&amp; 25.2 &amp; ( 22.7)&amp; 0.0 &amp; ( 0.0)<br />
18&amp;1.0 &amp; ( 0.9)&amp; 1.0 &amp; ( 0.9)&amp; 0.0 &amp; ( 0.0)<br />
19&amp;0.1 &amp; ( 0.0)&amp; 0.1 &amp; ( 0.0)&amp; 0.0 &amp; ( 0.0)<br />
20&amp; 0.3 &amp; (0.2)&amp; 0.3 &amp; (0.2)&amp; 0.0 &amp; ( 0.0)<br />
21&amp; 0.4 &amp; ( 0.3)&amp; 0.4 &amp; ( 0.3)&amp; 0.0 &amp; ( 0.0)<br />
</p>

<p>
[tab-3]
</p>

<p>
一簡約並列算法(共有メモリ版)の性能は，12のプロセッサで8程度の並列性能
を得ている\cite{asir-para}．$d$-グレブナー基底計算の並列版は実装中で
あるので，算法の組合わせによる全体性能を示すことはできないが，相互簡約
の部分の並列化，ペア並列性の低い部分，が高速化でき，良い性能が得られる
ることは明らかだろう．
</p>

<p>
para-asir
</p>

<p>
Attardi, G., Tracerso, C.,: Strategy&#x2013;Accurate Parallel Buchberger
Algorithms, J.Symb. Comp., 21/4-6 (1997), 411&#x2013;426
</p>

<p>
Beker,T., Weispfenning, V.: Gröbner Bases. GTM bf 141, Springer-Verlag,
1993
</p>

<p>
Faugére, J.C.: Parallelization of Gröbner basis <i>Proc. PASCO'94</i>, 1994,
124&#x2013;132
</p>

<p>
Faugére, J.C.: A new efficient algorithm for computing Gröbner bases
(\(F_4\)), <i>Journal of Pure and Applied Algebra</i> *139*(1&#x2013;3), 1999, 61&#x2013;88
</p>

<p>
Giovini, A., Mora, T., Niesi, G., Robbiano, L., Traverso, C.: "One sugar
cube, please" OR Slection strategies in the Buchberger algorithm, Proc.
ISSAC'91, 1991, 49&#x2013;54
</p>

<p>
Noro, M., Kando, T., Takeshima, T.: Solving a large scale problem by
parallel algebraic computation on AP3000, <i>Research Report ISIS-RR-97</i>,
FUJITSU LABS, 1997
</p>

<p>
Noro, M., Mckay, J.: Computation of replicable functions on Risa/Asir,
<i>Proc. PASCO'97</i>, ACM Press, 1997, 130&#x2013;138
</p>

<p>
鈴木正幸: 分散共有メモリを用いた並列Gröbner基底計算の性能評価,
第8回数式処理大会, 1999
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masayuki Suzuki</p>
<p class="date">Created: 2018-11-01 木 16:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
